In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})

In [3]:
df

   col1  col2
0     1     3
1     2     4

In [4]:
df.insert(1,'new col',23)

In [5]:
df

   col1  new col  col2
0     1       23     3
1     2       23     4

In [7]:
df.insert(1,'new col2',[45,56])

In [8]:
df

   col1  new col2  new col  col2
0     1        45       23     3
1     2        56       23     4

In [9]:
df.insert(0, "col1", [100, 100], allow_duplicates=True)

In [10]:
df

   col1  col1  new col2  new col  col2
0   100     1        45       23     3
1   100     2        56       23     4

In [11]:
df.insert(0, "col0", pd.Series([5, 6], index=[1, 2]))

In [12]:
df

   col0  col1  col1  new col2  new col  col2
0   NaN   100     1        45       23     3
1   5.0   100     2        56       23     4

In [20]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
for x in df:
    print(x)

A
B

In [21]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [22]:
df = pd.DataFrame({'species': ['bear', 'bear', 'marsupial'],
                  'population': [1864, 22000, 80000]},
                  index=['panda', 'polar', 'koala'])

In [23]:
df

         species  population
panda       bear        1864
polar       bear       22000
koala  marsupial       80000

In [24]:
for label, content in df.items():
    print(f'label: {label}')
    print(f'content: {content}', sep='\n')

label: species
content: panda         bear
polar         bear
koala    marsupial
Name: species, dtype: object
label: population
content: panda     1864
polar    22000
koala    80000
Name: population, dtype: int64

In [25]:
d = pd.DataFrame(data={'A': [1, 2, 3], 'B': [0, 4, 8]},
                 index=['a', 'b', 'c'])

In [26]:
d

   A  B
a  1  0
b  2  4
c  3  8

In [27]:
d.keys()

Index(['A', 'B'], dtype='object')

In [28]:
df = pd.DataFrame([[1, 1.5]], columns=['int', 'float'])

In [29]:
row = next(df.iterrows())[1]

In [30]:
row

int      1.0
float    1.5
Name: 0, dtype: float64

In [31]:
df

   int  float
0    1    1.5

In [34]:
row

int      1.0
float    1.5
Name: 0, dtype: float64

In [32]:
print(row['int'].dtype)

float64

In [33]:
print(df['int'].dtype)

int64

In [35]:
df = pd.DataFrame({'num_legs': [4, 2], 'num_wings': [0, 2]},
                  index=['dog', 'hawk'])

In [36]:
df

      num_legs  num_wings
dog          4          0
hawk         2          2

In [37]:
for row in df.itertuples():
    print(row)

Pandas(Index='dog', num_legs=4, num_wings=0)
Pandas(Index='hawk', num_legs=2, num_wings=2)

In [38]:
for row in df.itertuples(index=False):
    print(row)

Pandas(num_legs=4, num_wings=0)
Pandas(num_legs=2, num_wings=2)

In [39]:
for row in df.itertuples(name='Animal'):
    print(row)

Animal(Index='dog', num_legs=4, num_wings=0)
Animal(Index='hawk', num_legs=2, num_wings=2)

In [40]:
df = pd.DataFrame([('falcon', 'bird', 389.0),
                   ('parrot', 'bird', 24.0),
                   ('lion', 'mammal', 80.5),
                   ('monkey', 'mammal', np.nan)],
                  columns=('name', 'class', 'max_speed'))

In [41]:
df

     name   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [42]:
df.pop('class')

0      bird
1      bird
2    mammal
3    mammal
Name: class, dtype: object

In [43]:
df.pop('name')

0    falcon
1    parrot
2      lion
3    monkey
Name: name, dtype: object

In [44]:
df

   max_speed
0      389.0
1       24.0
2       80.5
3        NaN

In [45]:
df = pd.DataFrame({'animal': ['alligator', 'bee', 'falcon', 'lion',
                   'monkey', 'parrot', 'shark', 'whale', 'zebra']})

In [46]:
df

      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey
5     parrot
6      shark
7      whale
8      zebra

In [47]:
df.tail()

   animal
4  monkey
5  parrot
6   shark
7   whale
8   zebra

In [48]:
df.tail(5)

   animal
4  monkey
5  parrot
6   shark
7   whale
8   zebra

In [49]:
df.tail(-4)

   animal
4  monkey
5  parrot
6   shark
7   whale
8   zebra

In [50]:
d = {'num_legs': [4, 4, 2, 2],
     'num_wings': [0, 0, 2, 2],
     'class': ['mammal', 'mammal', 'mammal', 'bird'],
     'animal': ['cat', 'dog', 'bat', 'penguin'],
     'locomotion': ['walks', 'walks', 'flies', 'walks']}

In [51]:
d

{'num_legs': [4, 4, 2, 2],
 'num_wings': [0, 0, 2, 2],
 'class': ['mammal', 'mammal', 'mammal', 'bird'],
 'animal': ['cat', 'dog', 'bat', 'penguin'],
 'locomotion': ['walks', 'walks', 'flies', 'walks']}

In [52]:
df = pd.DataFrame(data=d)

In [53]:
df = df.set_index(['class', 'animal', 'locomotion'])

In [54]:
df

                           num_legs  num_wings
class  animal  locomotion
mammal cat     walks              4          0
       dog     walks              4          0
       bat     flies              2          2
bird   penguin walks              2          2

In [55]:
df.xs('mammal')

                   num_legs  num_wings
animal locomotion
cat    walks              4          0
dog    walks              4          0
bat    flies              2          2

In [56]:
df.xs(('mammal', 'dog', 'walks'))

num_legs     4
num_wings    0
Name: (mammal, dog, walks), dtype: int64

In [57]:
df.xs('cat', level=1)

                   num_legs  num_wings
class  locomotion
mammal walks              4          0

In [60]:
df.xs('cat',level=1)

                   num_legs  num_wings
class  locomotion
mammal walks              4          0

In [61]:
df.xs(('bird', 'walks'),
      level=[0, 'locomotion'])

         num_legs  num_wings
animal
penguin         2          2

In [62]:
df

                           num_legs  num_wings
class  animal  locomotion
mammal cat     walks              4          0
       dog     walks              4          0
       bat     flies              2          2
bird   penguin walks              2          2

In [63]:
df.xs('num_wings', axis=1)

class   animal   locomotion
mammal  cat      walks         0
        dog      walks         0
        bat      flies         2
bird    penguin  walks         2
Name: num_wings, dtype: int64

In [65]:
df

                           num_legs  num_wings
class  animal  locomotion
mammal cat     walks              4          0
       dog     walks              4          0
       bat     flies              2          2
bird   penguin walks              2          2

In [66]:
df = pd.DataFrame(
    [
        [24.3, 75.7, "high"],
        [31, 87.8, "high"],
        [22, 71.6, "medium"],
        [35, 95, "medium"],
    ],
    columns=["temp_celsius", "temp_fahrenheit", "windspeed"],
    index=pd.date_range(start="2014-02-12", end="2014-02-15", freq="D"),
)

In [67]:
df

            temp_celsius  temp_fahrenheit windspeed
2014-02-12          24.3             75.7      high
2014-02-13          31.0             87.8      high
2014-02-14          22.0             71.6    medium
2014-02-15          35.0             95.0    medium

In [68]:
df.pop('temp_celsius')

2014-02-12    24.3
2014-02-13    31.0
2014-02-14    22.0
2014-02-15    35.0
Freq: D, Name: temp_celsius, dtype: float64

In [69]:
df

            temp_fahrenheit windspeed
2014-02-12             75.7      high
2014-02-13             87.8      high
2014-02-14             71.6    medium
2014-02-15             95.0    medium

In [70]:
df.get(["temp_celsius", "windspeed"])

In [71]:
df

            temp_fahrenheit windspeed
2014-02-12             75.7      high
2014-02-13             87.8      high
2014-02-14             71.6    medium
2014-02-15             95.0    medium

In [72]:
ser = df['windspeed']
ser.get('2014-02-13')

'high'

In [73]:
df.get(["temp_celsius", "temp_kelvin"], default="default_value")

'default_value'

In [74]:
df

            temp_fahrenheit windspeed
2014-02-12             75.7      high
2014-02-13             87.8      high
2014-02-14             71.6    medium
2014-02-15             95.0    medium

In [75]:
ser.get('2014-02-10', '[unknown]')

'[unknown]'

In [76]:
df = pd.DataFrame({'num_legs': [2, 4], 'num_wings': [2, 0]},
                  index=['falcon', 'dog'])

In [77]:
df

        num_legs  num_wings
falcon         2          2
dog            4          0

In [78]:
df.isin([0, 2])

        num_legs  num_wings
falcon      True       True
dog        False       True

In [79]:
~df.isin([0, 2])

        num_legs  num_wings
falcon     False      False
dog         True      False

In [80]:
df.isin({'num_wings': [0, 3]})

        num_legs  num_wings
falcon     False      False
dog        False       True

In [81]:
other = pd.DataFrame({'num_legs': [8, 3], 'num_wings': [0, 2]},
                     index=['spider', 'falcon'])

In [82]:
df.isin(other)

        num_legs  num_wings
falcon     False       True
dog        False      False

In [83]:
s = pd.Series(range(5))

In [85]:
s.where(s > 0)

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [86]:
s.mask(s > 0)

0    0.0
1    NaN
2    NaN
3    NaN
4    NaN
dtype: float64

In [87]:
s = pd.Series(range(5))

In [88]:
t = pd.Series([True, False])

In [89]:
s.where(t, 99)

0     0
1    99
2    99
3    99
4    99
dtype: int64

In [91]:
t

0     True
1    False
dtype: bool

In [92]:
s.mask(t, 99)

0    99
1     1
2    99
3    99
4    99
dtype: int64

In [93]:
s.where(s > 1, 10)

0    10
1    10
2     2
3     3
4     4
dtype: int64

In [94]:
s.mask(s > 1, 10)

0     0
1     1
2    10
3    10
4    10
dtype: int64

In [95]:
df = pd.DataFrame(np.arange(10).reshape(-1, 2), columns=['A', 'B'])

In [96]:
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [97]:
m = df % 3 == 0

In [98]:
df.where(m, -df)

   A  B
0  0 -1
1 -2  3
2 -4 -5
3  6 -7
4 -8  9

In [99]:
m

       A      B
0   True  False
1  False   True
2  False  False
3   True  False
4  False   True

In [100]:
df.where(m, -df) == np.where(m, df, -df)

      A     B
0  True  True
1  True  True
2  True  True
3  True  True
4  True  True

In [101]:
df.where(m, -df) == df.mask(~m, -df)

      A     B
0  True  True
1  True  True
2  True  True
3  True  True
4  True  True

In [102]:
s = pd.Series(range(5))

In [103]:
s.where(s>0)

0    NaN
1    1.0
2    2.0
3    3.0
4    4.0
dtype: float64

In [104]:
df = pd.DataFrame({'A': range(1, 6),
                   'B': range(10, 0, -2),
                   'C C': range(10, 5, -1)})

In [105]:
df

   A   B  C C
0  1  10   10
1  2   8    9
2  3   6    8
3  4   4    7
4  5   2    6

In [106]:
df.query('A > B')

   A  B  C C
4  5  2    6

In [107]:
df[df.A > df.B]

   A  B  C C
4  5  2    6

In [108]:
df.query('B == `C C`')

   A   B  C C
0  1  10   10

In [109]:
df[df.B == df['C C']]

   A   B  C C
0  1  10   10

In [110]:
df = pd.DataFrame({'height': [1.5, 2.6], 'weight': [500, 800]},
                  index=['elk', 'moose'])

In [111]:
df

       height  weight
elk       1.5     500
moose     2.6     800

In [112]:
df[['height', 'weight']] + 1.5

       height  weight
elk       3.0   501.5
moose     4.1   801.5

In [113]:
df

       height  weight
elk       1.5     500
moose     2.6     800

In [114]:
df[['height', 'weight']] + [0.5, 1.5]

       height  weight
elk       2.0   501.5
moose     3.1   801.5

In [115]:
df[['height', 'weight']] + {'height': 0.5, 'weight': 1.5}

       height  weight
elk       2.0   501.5
moose     3.1   801.5

In [116]:
s1 = pd.Series([0.5, 1.5], index=['weight', 'height'])

In [117]:
s1

weight    0.5
height    1.5
dtype: float64

In [118]:
df[['height', 'weight']] + s1

       height  weight
elk       3.0   500.5
moose     4.1   800.5

In [119]:
s2 = pd.Series([0.5, 1.5], index=['elk', 'moose'])

In [120]:
df[['height', 'weight']] + s2

       elk  height  moose  weight
elk    NaN     NaN    NaN     NaN
moose  NaN     NaN    NaN     NaN

In [121]:
df[['height', 'weight']].add(s2, axis='index')

       height  weight
elk       2.0   500.5
moose     4.1   801.5

In [122]:
other = pd.DataFrame({'height': [0.2, 0.4, 0.6]},
                     index=['elk', 'moose', 'deer'])

In [123]:
other

       height
elk       0.2
moose     0.4
deer      0.6

In [124]:
df[['height', 'weight']] + other

       height  weight
deer      NaN     NaN
elk       1.7     NaN
moose     3.0     NaN

In [125]:
df

       height  weight
elk       1.5     500
moose     2.6     800

In [126]:
other

       height
elk       0.2
moose     0.4
deer      0.6

In [127]:
s1

weight    0.5
height    1.5
dtype: float64

In [128]:
s2

elk      0.5
moose    1.5
dtype: float64

In [129]:
df = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])

In [130]:
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [131]:
df+1

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [132]:
df.add(1)

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [133]:
df.div(10)

           angles  degrees
circle        0.0     36.0
triangle      0.3     18.0
rectangle     0.4     36.0

In [134]:
df.rdiv(10)

             angles   degrees
circle          inf  0.027778
triangle   3.333333  0.055556
rectangle  2.500000  0.027778

In [135]:
df - [1, 2]

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [136]:
df.sub([1, 2], axis='columns')

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [137]:
df.sub(pd.Series([1, 1, 1], index=['circle', 'triangle', 'rectangle']),
       axis='index')

           angles  degrees
circle         -1      359
triangle        2      179
rectangle       3      359

In [138]:
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [139]:
df.mul({'angles': 0, 'degrees': 2})

           angles  degrees
circle          0      720
triangle        0      360
rectangle       0      720

In [140]:
df.mul({'circle': 0, 'triangle': 2, 'rectangle': 3}, axis='index')

           angles  degrees
circle          0        0
triangle        6      360
rectangle      12     1080

In [141]:
other = pd.DataFrame({'angles': [0, 3, 4]},
                     index=['circle', 'triangle', 'rectangle'])

In [142]:
other

           angles
circle          0
triangle        3
rectangle       4

In [143]:
df * other

           angles  degrees
circle          0      NaN
triangle        9      NaN
rectangle      16      NaN

In [144]:
df.mul(other, fill_value=0)

           angles  degrees
circle          0      0.0
triangle        9      0.0
rectangle      16      0.0

In [145]:
df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
                             'degrees': [360, 180, 360, 360, 540, 720]},
                            index=[['A', 'A', 'A', 'B', 'B', 'B'],
                                   ['circle', 'triangle', 'rectangle',
                                    'square', 'pentagon', 'hexagon']])

In [146]:
df_multindex

             angles  degrees
A circle          0      360
  triangle        3      180
  rectangle       4      360
B square          4      360
  pentagon        5      540
  hexagon         6      720

In [147]:
df.div(df_multindex, level=1, fill_value=0)

             angles  degrees
A circle        NaN      1.0
  triangle      1.0      1.0
  rectangle     1.0      1.0
B square        0.0      0.0
  pentagon      0.0      0.0
  hexagon       0.0      0.0

In [148]:
df = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])

In [149]:
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [150]:
df + 1

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [151]:
df.add(1)

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [152]:
df.div(10)

           angles  degrees
circle        0.0     36.0
triangle      0.3     18.0
rectangle     0.4     36.0

In [153]:
df.rdiv(10)

             angles   degrees
circle          inf  0.027778
triangle   3.333333  0.055556
rectangle  2.500000  0.027778

In [154]:
df - [1, 2]

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [155]:
df.sub([1, 2], axis='columns')

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [156]:
df.sub(pd.Series([1, 1, 1], index=['circle', 'triangle', 'rectangle']),
       axis='index')

           angles  degrees
circle         -1      359
triangle        2      179
rectangle       3      359

In [157]:
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [158]:
df.mul({'angles': 0, 'degrees': 2})

           angles  degrees
circle          0      720
triangle        0      360
rectangle       0      720

In [159]:
df.mul({'circle': 0, 'triangle': 2, 'rectangle': 3}, axis='index')

           angles  degrees
circle          0        0
triangle        6      360
rectangle      12     1080

In [160]:
other = pd.DataFrame({'angles': [0, 3, 4]},
                     index=['circle', 'triangle', 'rectangle'])

In [161]:
other

           angles
circle          0
triangle        3
rectangle       4

In [162]:
df * other

           angles  degrees
circle          0      NaN
triangle        9      NaN
rectangle      16      NaN

In [163]:
df.mul(other, fill_value=0)

           angles  degrees
circle          0      0.0
triangle        9      0.0
rectangle      16      0.0

In [164]:
df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
                             'degrees': [360, 180, 360, 360, 540, 720]},
                            index=[['A', 'A', 'A', 'B', 'B', 'B'],
                                   ['circle', 'triangle', 'rectangle',
                                    'square', 'pentagon', 'hexagon']])

In [166]:
df_multindex

             angles  degrees
A circle          0      360
  triangle        3      180
  rectangle       4      360
B square          4      360
  pentagon        5      540
  hexagon         6      720

In [167]:
df.div(df_multindex, level=1, fill_value=0)

             angles  degrees
A circle        NaN      1.0
  triangle      1.0      1.0
  rectangle     1.0      1.0
B square        0.0      0.0
  pentagon      0.0      0.0
  hexagon       0.0      0.0

In [168]:
df = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])

In [169]:
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [170]:
df + 1

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [171]:
df.add(1)

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [172]:
df.div(10)

           angles  degrees
circle        0.0     36.0
triangle      0.3     18.0
rectangle     0.4     36.0

In [173]:
df.rdiv(10)

             angles   degrees
circle          inf  0.027778
triangle   3.333333  0.055556
rectangle  2.500000  0.027778

In [174]:
df - [1, 2]

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [175]:
df.sub([1, 2], axis='columns')

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [176]:
df.sub(pd.Series([1, 1, 1], index=['circle', 'triangle', 'rectangle']),
       axis='index')

           angles  degrees
circle         -1      359
triangle        2      179
rectangle       3      359

In [177]:
df.mul({'angles': 0, 'degrees': 2})

           angles  degrees
circle          0      720
triangle        0      360
rectangle       0      720

In [178]:
df.mul({'circle': 0, 'triangle': 2, 'rectangle': 3}, axis='index')

           angles  degrees
circle          0        0
triangle        6      360
rectangle      12     1080

In [179]:
other = pd.DataFrame({'angles': [0, 3, 4]},
                     index=['circle', 'triangle', 'rectangle'])

In [180]:
other

           angles
circle          0
triangle        3
rectangle       4

In [181]:
df * other

           angles  degrees
circle          0      NaN
triangle        9      NaN
rectangle      16      NaN

In [182]:
df.mul(other, fill_value=0)

           angles  degrees
circle          0      0.0
triangle        9      0.0
rectangle      16      0.0

In [183]:
df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
                             'degrees': [360, 180, 360, 360, 540, 720]},
                            index=[['A', 'A', 'A', 'B', 'B', 'B'],
                                   ['circle', 'triangle', 'rectangle',
                                    'square', 'pentagon', 'hexagon']])

In [184]:
df_multindex

             angles  degrees
A circle          0      360
  triangle        3      180
  rectangle       4      360
B square          4      360
  pentagon        5      540
  hexagon         6      720

In [185]:
df.div(df_multindex, level=1, fill_value=0)

             angles  degrees
A circle        NaN      1.0
  triangle      1.0      1.0
  rectangle     1.0      1.0
B square        0.0      0.0
  pentagon      0.0      0.0
  hexagon       0.0      0.0

In [186]:
df = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])

In [187]:
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [188]:
df + 1

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [189]:
df.add(1)

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [190]:
df.div(10)

           angles  degrees
circle        0.0     36.0
triangle      0.3     18.0
rectangle     0.4     36.0

In [191]:
df.rdiv(10)

             angles   degrees
circle          inf  0.027778
triangle   3.333333  0.055556
rectangle  2.500000  0.027778

In [192]:
df - [1, 2]

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [193]:
df.sub([1, 2], axis='columns')

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [194]:
df.sub(pd.Series([1, 1, 1], index=['circle', 'triangle', 'rectangle']),
       axis='index')

           angles  degrees
circle         -1      359
triangle        2      179
rectangle       3      359

In [195]:
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [196]:
df.rdiv(15)

           angles   degrees
circle        inf  0.041667
triangle     5.00  0.083333
rectangle    3.75  0.041667

In [197]:
df.mul({'angles': 0, 'degrees': 2})

           angles  degrees
circle          0      720
triangle        0      360
rectangle       0      720

In [198]:
df.mul({'circle': 0, 'triangle': 2, 'rectangle': 3}, axis='index')

           angles  degrees
circle          0        0
triangle        6      360
rectangle      12     1080

In [199]:
other = pd.DataFrame({'angles': [0, 3, 4]},
                     index=['circle', 'triangle', 'rectangle'])

In [200]:
other

           angles
circle          0
triangle        3
rectangle       4

In [201]:
df * other

           angles  degrees
circle          0      NaN
triangle        9      NaN
rectangle      16      NaN

In [202]:
df.mul(other, fill_value=0)

           angles  degrees
circle          0      0.0
triangle        9      0.0
rectangle      16      0.0

In [203]:
df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
                             'degrees': [360, 180, 360, 360, 540, 720]},
                            index=[['A', 'A', 'A', 'B', 'B', 'B'],
                                   ['circle', 'triangle', 'rectangle',
                                    'square', 'pentagon', 'hexagon']])

In [204]:
df_multindex

             angles  degrees
A circle          0      360
  triangle        3      180
  rectangle       4      360
B square          4      360
  pentagon        5      540
  hexagon         6      720

In [205]:
df.div(df_multindex, level=1, fill_value=0)

             angles  degrees
A circle        NaN      1.0
  triangle      1.0      1.0
  rectangle     1.0      1.0
B square        0.0      0.0
  pentagon      0.0      0.0
  hexagon       0.0      0.0

In [206]:
df = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])

In [207]:
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [208]:
df +1

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [209]:
df.add(1)

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [210]:
df.div(10)

           angles  degrees
circle        0.0     36.0
triangle      0.3     18.0
rectangle     0.4     36.0

In [211]:
df.rdiv(10)

             angles   degrees
circle          inf  0.027778
triangle   3.333333  0.055556
rectangle  2.500000  0.027778

In [212]:
df -[1,2]

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [213]:
df.sub([1, 2], axis='columns')

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [214]:
df.sub(pd.Series([1, 1, 1], index=['circle', 'triangle', 'rectangle']),
       axis='index')

           angles  degrees
circle         -1      359
triangle        2      179
rectangle       3      359

In [215]:
df.mul({'angles': 0, 'degrees': 2})

           angles  degrees
circle          0      720
triangle        0      360
rectangle       0      720

In [216]:
df.mul({'circle': 0, 'triangle': 2, 'rectangle': 3}, axis='index')

           angles  degrees
circle          0        0
triangle        6      360
rectangle      12     1080

In [217]:
other = pd.DataFrame({'angles': [0, 3, 4]},
                     index=['circle', 'triangle', 'rectangle'])
other

           angles
circle          0
triangle        3
rectangle       4

In [218]:
df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
                             'degrees': [360, 180, 360, 360, 540, 720]},
                            index=[['A', 'A', 'A', 'B', 'B', 'B'],
                                   ['circle', 'triangle', 'rectangle',
                                    'square', 'pentagon', 'hexagon']])
df_multindex

             angles  degrees
A circle          0      360
  triangle        3      180
  rectangle       4      360
B square          4      360
  pentagon        5      540
  hexagon         6      720

In [219]:
df.div(df_multindex, level=1, fill_value=0)

             angles  degrees
A circle        NaN      1.0
  triangle      1.0      1.0
  rectangle     1.0      1.0
B square        0.0      0.0
  pentagon      0.0      0.0
  hexagon       0.0      0.0

In [220]:
df = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [221]:
df + 1

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [222]:
df.add(1)

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [223]:
df.div(10)

           angles  degrees
circle        0.0     36.0
triangle      0.3     18.0
rectangle     0.4     36.0

In [224]:
df.rdiv(10)

             angles   degrees
circle          inf  0.027778
triangle   3.333333  0.055556
rectangle  2.500000  0.027778

In [225]:
df - [1, 2]

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [226]:
df.sub([1, 2], axis='columns')

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [227]:
df.sub(pd.Series([1, 1, 1], index=['circle', 'triangle', 'rectangle']),
       axis='index')

           angles  degrees
circle         -1      359
triangle        2      179
rectangle       3      359

In [228]:
df.mul({'angles': 0, 'degrees': 2})

           angles  degrees
circle          0      720
triangle        0      360
rectangle       0      720

In [229]:
df.mul({'circle': 0, 'triangle': 2, 'rectangle': 3}, axis='index')

           angles  degrees
circle          0        0
triangle        6      360
rectangle      12     1080

In [230]:
other = pd.DataFrame({'angles': [0, 3, 4]},
                     index=['circle', 'triangle', 'rectangle'])
other

           angles
circle          0
triangle        3
rectangle       4

In [231]:
df * other

           angles  degrees
circle          0      NaN
triangle        9      NaN
rectangle      16      NaN

In [232]:
df.mul(other, fill_value=0)

           angles  degrees
circle          0      0.0
triangle        9      0.0
rectangle      16      0.0

In [233]:
df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
                             'degrees': [360, 180, 360, 360, 540, 720]},
                            index=[['A', 'A', 'A', 'B', 'B', 'B'],
                                   ['circle', 'triangle', 'rectangle',
                                    'square', 'pentagon', 'hexagon']])

In [234]:
df_multindex

             angles  degrees
A circle          0      360
  triangle        3      180
  rectangle       4      360
B square          4      360
  pentagon        5      540
  hexagon         6      720

In [235]:
df.div(df_multindex, level=1, fill_value=0)

             angles  degrees
A circle        NaN      1.0
  triangle      1.0      1.0
  rectangle     1.0      1.0
B square        0.0      0.0
  pentagon      0.0      0.0
  hexagon       0.0      0.0

In [236]:
df = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])

In [237]:
df + 1

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [238]:
df.add(1)

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [239]:
df.div(10)

           angles  degrees
circle        0.0     36.0
triangle      0.3     18.0
rectangle     0.4     36.0

In [240]:
df.rdiv(10)

             angles   degrees
circle          inf  0.027778
triangle   3.333333  0.055556
rectangle  2.500000  0.027778

In [241]:
df - [1, 2]

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [242]:
df.sub([1, 2], axis='columns')

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [243]:
df.sub(pd.Series([1, 1, 1], index=['circle', 'triangle', 'rectangle']),
       axis='index')

           angles  degrees
circle         -1      359
triangle        2      179
rectangle       3      359

In [244]:
df.mul({'angles': 0, 'degrees': 2})

           angles  degrees
circle          0      720
triangle        0      360
rectangle       0      720

In [245]:
df.mul({'circle': 0, 'triangle': 2, 'rectangle': 3}, axis='index')

           angles  degrees
circle          0        0
triangle        6      360
rectangle      12     1080

In [246]:
other = pd.DataFrame({'angles': [0, 3, 4]},
                     index=['circle', 'triangle', 'rectangle'])

In [247]:
other

           angles
circle          0
triangle        3
rectangle       4

In [248]:
df * other

           angles  degrees
circle          0      NaN
triangle        9      NaN
rectangle      16      NaN

In [249]:
df.mul(other, fill_value=0)

           angles  degrees
circle          0      0.0
triangle        9      0.0
rectangle      16      0.0

In [250]:
df_multindex = pd.DataFrame({'angles': [0, 3, 4, 4, 5, 6],
                             'degrees': [360, 180, 360, 360, 540, 720]},
                            index=[['A', 'A', 'A', 'B', 'B', 'B'],
                                   ['circle', 'triangle', 'rectangle',
                                    'square', 'pentagon', 'hexagon']])
df_multindex

             angles  degrees
A circle          0      360
  triangle        3      180
  rectangle       4      360
B square          4      360
  pentagon        5      540
  hexagon         6      720

In [251]:
df.div(df_multindex, level=1, fill_value=0)

             angles  degrees
A circle        NaN      1.0
  triangle      1.0      1.0
  rectangle     1.0      1.0
B square        0.0      0.0
  pentagon      0.0      0.0
  hexagon       0.0      0.0

In [253]:
df.sub(pd.Series([1, 1, 1], index=['circle', 'triangle', 'rectangle']),
       axis='index')

           angles  degrees
circle         -1      359
triangle        2      179
rectangle       3      359

In [254]:
df = pd.DataFrame([[0, 1, -2, -1], [1, 1, 1, 1]])

In [255]:
df

   0  1  2  3
0  0  1 -2 -1
1  1  1  1  1

In [256]:
s = pd.Series([1, 1, 2, 1])

In [257]:
s

0    1
1    1
2    2
3    1
dtype: int64

In [258]:
df.dot(s)

0   -4
1    5
dtype: int64

In [259]:
other = pd.DataFrame([[0, 1], [1, 2], [-1, -1], [2, 0]])

In [260]:
df.dot(other)

   0  1
0  1  4
1  2  2

In [261]:
df @ other

   0  1
0  1  4
1  2  2

In [262]:
arr = np.array([[0, 1], [1, 2], [-1, -1], [2, 0]])

In [263]:
df.dot(arr)

   0  1
0  1  4
1  2  2

In [265]:
arr

array([[ 0,  1],
       [ 1,  2],
       [-1, -1],
       [ 2,  0]])

In [266]:
s2 = s.reindex([1, 0, 2, 3])
df.dot(s2)

0   -4
1    5
dtype: int64

In [267]:
s2

1    1
0    1
2    2
3    1
dtype: int64

In [268]:
df = pd.DataFrame({'angles': [0, 3, 4],
                   'degrees': [360, 180, 360]},
                  index=['circle', 'triangle', 'rectangle'])

In [269]:
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

In [270]:
df.sub([1, 2], axis='columns')

           angles  degrees
circle         -1      358
triangle        2      178
rectangle       3      358

In [271]:
df.mul({'circle': 0, 'triangle': 2, 'rectangle': 3}, axis='index')

           angles  degrees
circle          0        0
triangle        6      360
rectangle      12     1080

In [272]:
df = pd.DataFrame({'cost': [250, 150, 100],
                   'revenue': [100, 250, 300]},
                  index=['A', 'B', 'C'])

In [273]:
df

   cost  revenue
A   250      100
B   150      250
C   100      300

In [275]:
df == 100

    cost  revenue
A  False     True
B  False    False
C   True    False

In [276]:
df.eq(100)

    cost  revenue
A  False     True
B  False    False
C   True    False

In [277]:
df != pd.Series([100, 250], index=["cost", "revenue"])

    cost  revenue
A   True     True
B   True    False
C  False     True

In [280]:
df.ne(pd.Series([100, 300], index=["A", "D"]), axis='index')

   cost  revenue
A  True    False
B  True     True
C  True     True
D  True     True

In [281]:
df == [250, 100]

    cost  revenue
A   True     True
B  False    False
C  False    False

In [282]:
df.eq([250, 250, 100], axis='index')

    cost  revenue
A   True    False
B  False     True
C   True    False

In [285]:
other = pd.DataFrame({'revenue': [300, 250, 100, 150]},
                     index=['A', 'B', 'C', 'D'])

In [286]:
other

   revenue
A      300
B      250
C      100
D      150

In [287]:
df.gt(other)

    cost  revenue
A  False    False
B  False    False
C  False     True
D  False    False

In [288]:
df_multindex = pd.DataFrame({'cost': [250, 150, 100, 150, 300, 220],
                             'revenue': [100, 250, 300, 200, 175, 225]},
                            index=[['Q1', 'Q1', 'Q1', 'Q2', 'Q2', 'Q2'],
                                   ['A', 'B', 'C', 'A', 'B', 'C']])
df_multindex

      cost  revenue
Q1 A   250      100
   B   150      250
   C   100      300
Q2 A   150      200
   B   300      175
   C   220      225

In [289]:
df.le(df_multindex, level=1)

       cost  revenue
Q1 A   True     True
   B   True     True
   C   True     True
Q2 A  False     True
   B   True    False
   C   True    False

In [291]:
df = pd.DataFrame({'cost': [250, 150, 100],
                   'revenue': [100, 250, 300]},
                  index=['A', 'B', 'C'])

In [292]:
df

   cost  revenue
A   250      100
B   150      250
C   100      300

In [293]:
df == 100

    cost  revenue
A  False     True
B  False    False
C   True    False

In [294]:
df.eq(100)

    cost  revenue
A  False     True
B  False    False
C   True    False

In [295]:
df != pd.Series([100, 250], index=["cost", "revenue"])

    cost  revenue
A   True     True
B   True    False
C  False     True

In [296]:
df.ne(pd.Series([100, 300], index=["A", "D"]), axis='index')

   cost  revenue
A  True    False
B  True     True
C  True     True
D  True     True

In [297]:
df == [250, 100]

    cost  revenue
A   True     True
B  False    False
C  False    False